recept/src/Documents/СпиасниеВПроизводство/СпиасниеВПроизводство.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СпиасниеВПроизводство</name>
  <basedOn>Document.Рецептуры</basedOn>
  <registerRecords>AccumulationRegister.СтоимостьМатериалов</registerRecords>
  <registerRecords>AccumulationRegister.ВПроизводстве</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиМатериалов</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.Рецептуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокументаОснования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧасть1</name>
    <attributes>
      <name>НаменованиеМатериала</name>
      <type>
        <types>CatalogRef.НоменклатураМатериалы</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоМатериала</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Остаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Действие</name>
      <type>
        <types>EnumRef.СостояниеОбеспечения</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

recept/src/Documents/СпиасниеВПроизводство/Forms/ФормаДокумента/Module.bsl
&НаСервереБезКонтекста
Функция ПолучитьЕдИзмМатериала(НоменклатураМатериалы) 
// Функция передает в процедуру единицу измерения материала из справочника НоменклатураМатериалы

	Возврат НоменклатураМатериалы.ЕдиницаИзмеренияСырья; 
	                     	
КонецФункции

&НаКлиенте
Процедура ТабличнаяЧасть1ПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.ТабличнаяЧасть1.ТекущиеДанные;
	
	Для Каждого СтрокаТабличнойЧасти Из Объект.ТабличнаяЧасть1 Цикл
		
		 //Получает остаток из ркгистра
		СтрокаТабличнойЧасти.Остаток = РаботаСоСправочниками.ОстаткиМатериалов(СтрокаТабличнойЧасти.НаменованиеМатериала);
		СтрокаТабличнойЧасти.ЕдиницаИзмерения = ПолучитьЕдИзмМатериала(СтрокаТабличнойЧасти.НаменованиеМатериала);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("Документ.СпиасниеВПроизводство.Проведен", Объект.Ссылка, ЭтотОбъект);
КонецПроцедуры
